Repository: GulshirinAved/Belle
Catalog: lib/src/core/src/l10n/translates/app_*.arb
Languages: tk

# locale
source: {lang, select, ru{Русский} tk{Türkmen} en{English} other{Не найдено}}
tk: {lang, select, ru{Rus} tk{Türkmen} en{Iňlis} other{Başga}}

# snack_title
source: {message, select, success{Success} warning{Warning} message{Message} error{Error} other{Не найдено}}
tk: {message, select, success{Üstünlik} warning{Duýduryş} message{Habar} error{Ýalňyşlyk} other{Başga}}

source: Client
tk: Müşderi

source: Show
tk: Görkez

# empty
source: List is empty
tk: Spisok boş

source: Retry
tk: Gaýtadan

# error_occurred
source: Looks like there's a problem. Make sure your internet's working.
tk: Näsazlyk ýüze çykdy. Internet aragatnaşygyňyzy barlaň

source: Phone number
tk: Telefon belgisi

source: Password
tk: Açar sözi

# required
source: Required field
tk: Hökmany

# phone_between
source: Phone number must be in range of {start_range} - {end_range}.
tk: Telefon belgiňiz {start_range} we {end_range} aralygynda bolmaly.

source: Yes
tk: Hawa

source: No
tk: Ýok

source: Edit
tk: Üýtget

source: Delete
tk: Poz

source: Notifications
tk: Ýatlamalar

# no_notifications
source: You don't have any notifications yet.
tk: Häzirki wagtda duýduryş ýok.

# name_surname
source: Name and surname
tk: Adyňyz we familiýaňyz

source: Confirm
tk: Tassykla

# enter_info_to_contact
source: Please enter your name and phone number. So that the master can contact you
tk: Master siziň bilen habarlaşar ýaly, adyňyzy we telefon belgiňizi giriziň

# request_sent_success
source: Your request has been successfully sent.
tk: Ýüz tutmaňyz üstünlikli iberildi.

# register_to_see_status
source: If you want to see your status, please register.
tk: Ýagdaýyny görmek üçin, hasaba duruň

# register_to_see_favorites
source: Please Register/Login to see favorites
tk: Halanlanylanlary görmek üçin hasaba duruň/giriň

source: Show request status
tk: Ýüz tutmaň ýagdaýyny görkez

source: Register
tk: Hasaba durmak

# want_to_delete
source: Are you sure want to delete?
tk: Pozmak isleýärsiňizmi?

source: Return to main
tk: Baş sahypa dolan

# continue_title
source: Continue
tk: Dowam et

source: Choose language
tk: Dil saýla

source: Choose theme
tk: Tema saýla

# for_women
source: Women
tk: Aýallara

# for_men
source: Men
tk: Erkeklere

source: Woman
tk: Aýal

source: Man
tk: Erkek

source: Top rated stylist
tk: Iň gowy masterler

source: See All
tk: Hemmesi

source: Profile
tk: Profil

# new_masters
source: New masters on Belle
tk: Täze masterlar

source: Explore services
tk: Hyzmatlary gör

source: No categories
tk: Kategoriýa ýok

source: Sort
tk: Tertiple

source: Filter
tk: Filtr

source: Book now
tk: Häzir belle

source: Apply
tk: Giriz

source: Delete all
tk: Hemmesini poz

source: Reset
tk: Täzeden düz

# sort_by
source: Sort by {name} ({type, select, asc{Ascending} desc{Descending} other{Other}})
tk: {name} boýunça tertiple ({type, select, asc{Ösýän tertipde} desc{Kemelýän tertipde} other{Başga}})

# by_price
source: Price
tk: Bahasy

# by_rating
source: Best rating
tk: Reýtingi

source: Reviews
tk: Teswirler

source: My services
tk: Hyzmatlarym

source: About me
tk: Men barada

source: Choose
tk: Saýla

source: Chosen
tk: Saýlandy

# choose_date
source: Choose a date
tk: Senäni saýla

source: Working hours
tk: Iş wagty

source: Home
tk: Öýde

source: Explore
tk: Gözle

source: Clients
tk: Müşderiler

source: Favorites
tk: Halanlarym

source: Report
tk: Şikaýat etmek

source: Booking
tk: Bellemek

source: Total time
tk: Jemi wagty

source: Total payment
tk: Jemi töleg

source: Add more
tk: Goşmaça goş

source: Choose your day
tk: Günüňizi saýlaň

source: Show calendar
tk: Kalendary görkez

source: Service location
tk: Hyzmat ýeri

# choose_time_for_services
source: Choose time for selected services
tk: Hyzmat(lar) üçin wagt saýlaň

# chosen_services
source: Chosen {count, select, 1{1 service} other {{count} services}}
tk: {count, select, 1{1 hyzmat} other {{count} hyzmat}} saýlandy

# booking_status
source: {status, select, reschedule{Request for re-recording} cancelled{Cancelled} confirmed{Confirmed} waiting{Waiting} clientArrived{Client arrived} completed{Completed} other{Not found}}
tk: {status, select, reschedule{Täzeden bellik} cancelled{Ýatyryldy} confirmed{Tassyklandy} waiting{Garaşylýar} clientArrived{Müşderi geldi} completed{Tamamlandy} other{Tapylmady}}

source: Read
tk: Okaldy

source: Details
tk: Giňişleýin

# call_title
source: Call
tk: Jaň et

source: Search
tk: Gözleg

source: Send code
tk: Kody iber

source: Login
tk: Giriş

# already_user
source: Already a user?
tk: Hasabyňyz barmy?

# dont_have_account
source: Don't have an account?
tk: Hasabyňyz ýokmy?

# agree_with_policy
source: Я согласен с Пользовательским соглашением; Политикой конфиденциальности
tk: Men Ulanyjy şertnamasyny; Gizlinlik syýasatyny we Masterler bilen Şertnamany kabul edýärin

source: You
tk: Siz

# service_locations
source: {location, select, in_salon{In salon} away{Away} other{Other}}
tk: {location, select, in_salon{Salonda} away{Öýde} other{Başga}}

source: First name
tk: Ady

source: Last name
tk: Familiýasy

# we_sent_otp_code
source: We have sent a message with a confirmation code to your number.
tk: Tassyklama kodyny telefon belgiňize iberdik

# please_check_your_phone
source: Please check your phone number +993 {phone_prefix} ****{phone}
tk: +993 {phone_prefix} ****{phone} belgiňizi barlaň

source: Wrong code
tk: Kod ýalňyş

# send_code_again
source: Send the code again in
tk: Kody täzeden iber

source: Resend code
tk: Täzeden kody iber

source: User agreement
tk: Ulanyjy şertnamasy

# master_contract
source: Contract with masters
tk: Ussatlar bilen şertnama

# privacy
source: Privacy policy
tk: Gizlinlik syýasaty

source: My bookings
tk: Belliklerim

source: Active
tk: Aktiw

source: History
tk: Taryh

# no_bookings
source: You don't have a booking history yet.
tk: Häzirki wagtda bellik ýok

source: Booking main info
tk: Bellik barada esasy maglumat

source: All
tk: Hemmesi

source: Know languages
tk: Bilýän dilleri

source: App version
tk: Programmanyň wersiýasy

source: Delete account
tk: Hasaby poz

source: Contact Us
tk: Biz bilen habarlaşyň

source: Personal info
tk: Şahsy maglumat

source: Address
tk: Salgy

source: Save
tk: Ýatda sakla

source: Main profile
tk: Esasy profil

# did_not_find
source: Didn’t find what you were looking for?
tk: Gözleýän zadyňyzy tapmadyňyzmy?

# register_to_suggest_service
source: You can suggest a new category after registering.
tk: Täze kategoriýa teklip etmek üçin hasap açmaly

source: Your gender
tk: Jynsyňyz

# you_can_change_once_per_month
source: You can change this option once per month
tk: Bu parametri aýda bir gezek üýtgedip bilersiňiz

source: Logout
tk: Hasapdan çyk

source: Add services
tk: Hyzmat goş

source: Time
tk: Wagt

source: Price
tk: Baha

source: From
tk: Başlap

source: To
tk: Çenli

source: Make main
tk: Esasy et

source: Service name
tk: Hyzmatyň ady

source: Service duration
tk: Hyzmatyň wagty

# service_description
source: Service description (optional)
tk: Hyzmat barada düşündiriş (hökmany däl)

source: Fixed price
tk: Belli baha

source: Price range
tk: Bahalaryň aralygy

source: Min price
tk: Iň az baha

source: Max price
tk: Iň köp baha

source: Choose service category
tk: Hyzmat kategoriýasyny saýla

source: Delete service
tk: Hyzmaty poz

# delete_service_desc
source: Are you sure to delete this service?
tk: Bu hyzmaty pozmak isleýärsiňizmi?

source: Edit service
tk: Hyzmaty üýtget

# vacation
source: Vacation/Time off
tk: Dynç/Rugsat

source: Duration
tk: Dowamlylygy

source: Working days
tk: Iş günleri

source: Date start
tk: Başlangyç senesi

# break_time
source: Break
tk: Arakesme

source: Expired date
tk: Gutarýan senesi

source: Not working days
tk: Dynç günleri

source: Reason
tk: Sebäbi

source: Schedule
tk: Iş tertibi

source: Choose schedule start time
tk: Iş tertibiniň başlaýan wagtyny saýla

source: Choose schedule end time
tk: Iş tertibiniň gutarýan wagtyny saýla

source: Cancel
tk: Ýatyr

source: Choose break start time
tk: Arakesmäniň başlaýan wagtyny saýla

source: Choose break end time
tk: Arakesmäniň gutarýan wagtyny saýla

source: Choose schedule start date
tk: Iş tertibiniň başlangyç senesini saýla

source: Choose schedule range
tk: Tertip araçägini saýla

source: Choose days
tk: Günleri saýla

source: Frequency
tk: Ýygylyk

source: Choose reason
tk: Sebäbi saýla

source: Free slots today
tk: Günüň boş wagtlary

# new_message
source: You've just got a new message
tk: Täze habar

source: Ask to reschedule
tk: Täzeden bellemegi sora

source: Reschedule
tk: Täzeden bellemek

# hour_short
source: h
tk: s.

# this_will_affects_client_search
source: This will affect the client's search results
tk: Bu müşderileriň gözleg netijelerine täsir eder

source: Pick avatar
tk: Awatar saýla

# personal_info_updated
source: Personal info updated successfully
tk: Şahsy maglumatyňyz üstünlikli täzelendi

# avatar_updated
source: Avatar was updated successfully
tk: Awataryňyz üstünlikli täzelendi

# avatar_deleted
source: Avatar was deleted successfully
tk: Awataryňyz üstünlikli pozuldy

source: Work location
tk: Iş ýeri

source: Select region
tk: Welaýaty saýla

source: Select city
tk: Şäheri saýla

source: Add portfolio images
tk: Portfolio suradyny goş

source: Portfolio images added successfully
tk: Portfolio suratlary üstünlikli goşuldy

source: Portfolio images deleted successfully
tk: Portfolio suratlary üstünlikli pozuldy

source: Date
tk: Sene

source: Services
tk: Hyzmatlar

source: Status
tk: Ýagdaýy

# text_title
source: Text
tk: Ýazmak

source: Complete
tk: Tamamlamak

source: Add new client
tk: Müşderi goş

# choose_day_for_reschedule
source: Select a day to rescheduling
tk: Täzelemek üçin bir gün saýlaň

source: Cancel booking
tk: Brony aýyrmak

# confirm_cancel_booking
source: Are you sure you want to cancel your booking?
tk: Siziň bronňyzy hakykatdan hem ýatyrasyňyz gelýärmi?

# return_text
source: Return
tk: Gaýdyp barmak
